# -*- eval: (org-babel-lob-ingest "./ob-haskell-common.org"); -*-

#+TITLE: Composing Types

#+PROPERTY: header-args:haskell :results replace output
#+PROPERTY: header-args:haskell+ :noweb yes
#+PROPERTY: header-args:haskell+ :wrap EXAMPLE

* 25.2 Common Functions as Types
NOTE: /Monad Tranformers/ are commonly written as newtype to reduce
overhead since they are never sum or product type but only wrapping
one extra layer of (monadic) structure around another type.

#+BEGIN_SRC haskell
newtype Identity a = Identity { runIdentity :: a }
:t id
:k Identity

newtype Compose f g a = Compose { getCompose :: f (g a) }
:t (.)
:k Compose
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
id :: a -> a
Identity :: * -> *
(.) :: (b -> c) -> (a -> b) -> a -> c
Compose :: (* -> *) -> (* -> *) -> * -> *
#+END_EXAMPLE

